In [1]:
import sqlite3
from sqlite3 import Error

In [2]:
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

In [3]:
database = "sqlite_db_pythonsqlite.db"
conn = create_connection(database)

2.6.0

In [4]:
def run_task(query, conn=conn):
    cur = conn.cursor()
    cur.execute(query);
    rows = cur.fetchall()
    for row in rows:
        print(row)

In [5]:
query1 = """
    SELECT name
    FROM Facilities
    WHERE membercost > 0;
    """

In [6]:
run_task(query1)

('Tennis Court 1',)
('Tennis Court 2',)
('Massage Room 1',)
('Massage Room 2',)
('Squash Court',)

In [7]:
query2= """
    SELECT name
    FROM Facilities
    WHERE membercost = 0;
    """

In [8]:
run_task(query2)

('Badminton Court',)
('Table Tennis',)
('Snooker Table',)
('Pool Table',)

In [9]:
query3 = """
    SELECT facid, name, membercost, monthlymaintenance
    FROM Facilities
    WHERE membercost > 0 AND membercost < 0.2 * monthlymaintenance;
    """

In [10]:
run_task(query3)

(0, 'Tennis Court 1', 5, 200)
(1, 'Tennis Court 2', 5, 200)
(4, 'Massage Room 1', 9.9, 3000)
(5, 'Massage Room 2', 9.9, 3000)
(6, 'Squash Court', 3.5, 80)

In [11]:
query4 = """
    SELECT *
    FROM Facilities
    WHERE facid IN (1,5)
"""

In [12]:
run_task(query4)

(1, 'Tennis Court 2', 5, 25, 8000, 200)
(5, 'Massage Room 2', 9.9, 80, 4000, 3000)

In [13]:
query5 = """
    SELECT name, monthlymaintenance,
    CASE 
        WHEN monthlymaintenance > 100 THEN 'expensive'
        ELSE 'cheap'
    END AS expenselabel
    FROM Facilities
"""

In [14]:
run_task(query5)

('Tennis Court 1', 200, 'expensive')
('Tennis Court 2', 200, 'expensive')
('Badminton Court', 50, 'cheap')
('Table Tennis', 10, 'cheap')
('Massage Room 1', 3000, 'expensive')
('Massage Room 2', 3000, 'expensive')
('Squash Court', 80, 'cheap')
('Snooker Table', 15, 'cheap')
('Pool Table', 15, 'cheap')

In [15]:
query6 = """
    SELECT firstname, surname
    FROM `Members`
    WHERE joindate = (SELECT MAX(joindate) FROM `Members`);
"""

In [16]:
run_task(query6)

('Darren', 'Smith')

In [17]:
query7 = """
    SELECT DISTINCT f.name, m.firstname || ' ' || m.surname AS membername
    FROM Bookings AS b
    INNER JOIN Facilities AS f
    USING(facid)
    INNER JOIN Members AS m
    USING(memid)
    WHERE b.facid IN (0,1)
    ORDER BY membername;
"""

In [18]:
run_task(query7)

('Tennis Court 1', 'Anne Baker')
('Tennis Court 2', 'Anne Baker')
('Tennis Court 2', 'Burton Tracy')
('Tennis Court 1', 'Burton Tracy')
('Tennis Court 1', 'Charles Owen')
('Tennis Court 2', 'Charles Owen')
('Tennis Court 2', 'Darren Smith')
('Tennis Court 1', 'David Farrell')
('Tennis Court 2', 'David Farrell')
('Tennis Court 2', 'David Jones')
('Tennis Court 1', 'David Jones')
('Tennis Court 1', 'David Pinker')
('Tennis Court 1', 'Douglas Jones')
('Tennis Court 1', 'Erica Crumpet')
('Tennis Court 2', 'Florence Bader')
('Tennis Court 1', 'Florence Bader')
('Tennis Court 2', 'GUEST GUEST')
('Tennis Court 1', 'GUEST GUEST')
('Tennis Court 1', 'Gerald Butters')
('Tennis Court 2', 'Gerald Butters')
('Tennis Court 2', 'Henrietta Rumney')
('Tennis Court 1', 'Jack Smith')
('Tennis Court 2', 'Jack Smith')
('Tennis Court 1', 'Janice Joplette')
('Tennis Court 2', 'Janice Joplette')
('Tennis Court 2', 'Jemima Farrell')
('Tennis Court 1', 'Jemima Farrell')
('Tennis Court 1', 'Joan Coplin')
('Tennis Court 1', 'John Hunt')
('Tennis Court 2', 'John Hunt')
('Tennis Court 1', 'Matthew Genting')
('Tennis Court 2', 'Millicent Purview')
('Tennis Court 2', 'Nancy Dare')
('Tennis Court 1', 'Nancy Dare')
('Tennis Court 2', 'Ponder Stibbons')
('Tennis Court 1', 'Ponder Stibbons')
('Tennis Court 2', 'Ramnaresh Sarwin')
('Tennis Court 1', 'Ramnaresh Sarwin')
('Tennis Court 2', 'Tim Boothe')
('Tennis Court 1', 'Tim Boothe')
('Tennis Court 2', 'Tim Rownam')
('Tennis Court 1', 'Tim Rownam')
('Tennis Court 2', 'Timothy Baker')
('Tennis Court 1', 'Timothy Baker')
('Tennis Court 1', 'Tracy Smith')
('Tennis Court 2', 'Tracy Smith')

In [19]:
query8 = """
    SELECT f.name, m.firstname || ' ' || m.surname AS membername,
    CASE 
        WHEN b.memid=0 THEN guestcost*slots
        ELSE membercost*slots
    END AS cost
    FROM Bookings AS b
    INNER JOIN Facilities AS f
    USING(facid)
    INNER JOIN Members AS m
    USING(memid)
    WHERE starttime LIKE '2012-09-14%' AND cost > 30
    ORDER BY cost DESC;
"""

In [20]:
run_task(query8)

('Massage Room 2', 'GUEST GUEST', 320)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Tennis Court 2', 'GUEST GUEST', 150)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 2', 'GUEST GUEST', 75)
('Squash Court', 'GUEST GUEST', 70.0)
('Massage Room 1', 'Jemima Farrell', 39.6)
('Squash Court', 'GUEST GUEST', 35.0)
('Squash Court', 'GUEST GUEST', 35.0)

In [21]:
query9 = """
    SELECT f.name, m.firstname || ' ' || m.surname AS membername,
    CASE 
        WHEN b.memid=0 THEN guestcost*slots
        ELSE membercost*slots
    END AS cost
    FROM (SELECT * FROM Bookings WHERE starttime LIKE '2012-09-14%') AS b
    INNER JOIN Facilities AS f
    USING(facid)
    INNER JOIN Members AS m
    USING(memid)
    WHERE cost > 30
    ORDER BY cost DESC;
"""

In [22]:
run_task(query9)

('Massage Room 2', 'GUEST GUEST', 320)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Massage Room 1', 'GUEST GUEST', 160)
('Tennis Court 2', 'GUEST GUEST', 150)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 1', 'GUEST GUEST', 75)
('Tennis Court 2', 'GUEST GUEST', 75)
('Squash Court', 'GUEST GUEST', 70.0)
('Massage Room 1', 'Jemima Farrell', 39.6)
('Squash Court', 'GUEST GUEST', 35.0)
('Squash Court', 'GUEST GUEST', 35.0)

In [23]:
query10 = """
    SELECT name, SUM(revenue) AS totalrevenue 
    FROM (SELECT f.name,  
            CASE 
                WHEN b.memid != 0 THEN f.membercost*b.slots 
                ELSE f.guestcost*b.slots 
            END AS revenue
    FROM Facilities AS f 
    INNER JOIN Bookings AS b
    ON b.facid = f.facid) AS sub
    GROUP BY sub.name
    HAVING totalrevenue < 1000
    ORDER BY totalrevenue;
"""

In [24]:
run_task(query10)

('Table Tennis', 180)
('Snooker Table', 240)
('Pool Table', 270)

In [25]:
query11 = """
    SELECT m1.firstname, m1.surname, m2.firstname, m2.surname    
    FROM Members AS m1
    INNER JOIN Members AS m2
    ON m1.recommendedby = m2.memid
    WHERE m1.recommendedby > 0
    ORDER BY m1.surname, m1.firstname;
"""

In [26]:
run_task(query11)

('Florence', 'Bader', 'Ponder', 'Stibbons')
('Anne', 'Baker', 'Ponder', 'Stibbons')
('Timothy', 'Baker', 'Jemima', 'Farrell')
('Tim', 'Boothe', 'Tim', 'Rownam')
('Gerald', 'Butters', 'Darren', 'Smith')
('Joan', 'Coplin', 'Timothy', 'Baker')
('Erica', 'Crumpet', 'Tracy', 'Smith')
('Nancy', 'Dare', 'Janice', 'Joplette')
('Matthew', 'Genting', 'Gerald', 'Butters')
('John', 'Hunt', 'Millicent', 'Purview')
('David', 'Jones', 'Janice', 'Joplette')
('Douglas', 'Jones', 'David', 'Jones')
('Janice', 'Joplette', 'Darren', 'Smith')
('Anna', 'Mackenzie', 'Darren', 'Smith')
('Charles', 'Owen', 'Darren', 'Smith')
('David', 'Pinker', 'Jemima', 'Farrell')
('Millicent', 'Purview', 'Tracy', 'Smith')
('Henrietta', 'Rumney', 'Matthew', 'Genting')
('Ramnaresh', 'Sarwin', 'Florence', 'Bader')
('Jack', 'Smith', 'Darren', 'Smith')
('Ponder', 'Stibbons', 'Burton', 'Tracy')
('Henry', 'Worthington-Smyth', 'Tracy', 'Smith')

In [27]:
query12 = """
    SELECT name, COUNT(memid) AS memusage
    FROM Bookings
    INNER JOIN Facilities
    USING(facid)
    WHERE memid != 0
    GROUP BY name;
"""

In [28]:
run_task(query12)

('Badminton Court', 344)
('Massage Room 1', 421)
('Massage Room 2', 27)
('Pool Table', 783)
('Snooker Table', 421)
('Squash Court', 195)
('Table Tennis', 385)
('Tennis Court 1', 308)
('Tennis Court 2', 276)

In [29]:
query13 = """
    SELECT name, STRFTIME('%m', starttime) AS month, COUNT(memid) AS memusage
    FROM Bookings
    INNER JOIN Facilities
    USING (facid)
    WHERE memid != 0
    GROUP BY name, month
    ORDER BY name, month;
"""

In [30]:
run_task(query13)

('Badminton Court', '07', 51)
('Badminton Court', '08', 132)
('Badminton Court', '09', 161)
('Massage Room 1', '07', 77)
('Massage Room 1', '08', 153)
('Massage Room 1', '09', 191)
('Massage Room 2', '07', 4)
('Massage Room 2', '08', 9)
('Massage Room 2', '09', 14)
('Pool Table', '07', 103)
('Pool Table', '08', 272)
('Pool Table', '09', 408)
('Snooker Table', '07', 68)
('Snooker Table', '08', 154)
('Snooker Table', '09', 199)
('Squash Court', '07', 23)
('Squash Court', '08', 85)
('Squash Court', '09', 87)
('Table Tennis', '07', 48)
('Table Tennis', '08', 143)
('Table Tennis', '09', 194)
('Tennis Court 1', '07', 65)
('Tennis Court 1', '08', 111)
('Tennis Court 1', '09', 132)
('Tennis Court 2', '07', 41)
('Tennis Court 2', '08', 109)
('Tennis Court 2', '09', 126)